package src.main.java.com.practicejvfirst;

public class jvpractice5 {

    public static void main(String[] args) {

        // 시스템 요구사항 만들어서 프로그램 만들기

        /* 프로그램 개요
        * 식당에서 요리사가 서빙하는 기계를 작동하는 프로그램
        *
        *
        * 시스템 요구사항
        * 1. 요리사는 전원 켜기, 식탁으로 보내기, 되돌아오기, 전원 끄기를 할 수 있다.
        * 2. 기계는 처음에 정지 상태로 대기중이다.
        * 3. 요리사는 먼저 기계의 전원을 켠다. 이미 켜져있으면 다시 전원을 켤 수 없다.
        * 4. 요리사가 보내기를 누르면 전원이 켜진 상태일 경우 기계는 1m/h 증가하며 앞으로 나간다.
        * 5. 기계가 속도가 0으로 떨어지며 식탁에 도착하면 멈춘다.
        * 6. 전원끄기를 누를 때 기계가 꺼져있으면 이미 멈춰있는 상태라고 안내한다.
        * 7. 요리사가 전원을 
        * 8. 기계가 식탁으로 보내지거나 주방으로 되돌아오는 중이면 전원을 켤 수 없다.
        *
         */



    }
}
